{
  "todos": {
    "Coordinator": {
      "1": {
        "id": "1",
        "content": "Implement automated question generation system",
        "details": "1. Set up Supabase cron job to run at 6 AM Nigerian time (UTC+1) every 3 days. 2. Create question generation function that calls DeepSeek API to generate 50 questions per subject. 3. Implement database schema to store multiple question sets with timestamps. 4. Ensure questions are generated for all subjects automatically.",
        "status": "completed",
        "priority": "high"
      },
      "2": {
        "id": "2",
        "content": "Update database schema for question set management",
        "details": "1. Create question_sets table to store multiple sets per subject with timestamps. 2. Create questions table linked to question_sets. 3. Modify user tracking to work with multiple question sets. 4. Implement proper indexing for efficient querying.",
        "status": "completed",
        "priority": "high"
      },
      "3": {
        "id": "3",
        "content": "Update subscription logic for 3-day cycles with question sets",
        "details": "1. Modify useSubscription.ts to track access to different question sets. 2. Implement logic where first question set per subject is free. 3. Update checkQuestionAccess() to work with question set IDs. 4. Handle subscription validation for accessing newer question sets.",
        "status": "completed",
        "priority": "high"
      },
      "4": {
        "id": "4",
        "content": "Build question set management UI",
        "details": "1. Create question set listing page showing available sets by date. 2. Add delete functionality for question sets. 3. Update dashboard to show latest available question sets. 4. Add navigation between different question sets. 5. Show subscription status for each question set.",
        "status": "completed",
        "priority": "high"
      },
      "5": {
        "id": "5",
        "content": "Update all UI text for new subscription model",
        "details": "1. Update all text to reflect '50 questions every 3 days per subject'. 2. Update messaging about automatic delivery at 6 AM Nigerian time. 3. Update PaywallModal and subscription messaging. 4. Add explanatory text about question set management.",
        "status": "completed",
        "priority": "medium"
      },
      "6": {
        "id": "6",
        "content": "Deploy and test automated system",
        "details": "1. Deploy updated application with new features. 2. Test cron job execution. 3. Verify question generation works correctly. 4. Test subscription logic with multiple question sets. 5. Verify Nigerian timezone handling.",
        "status": "completed",
        "priority": "medium"
      }
    }
  }
}