📄 Extracted from page: JAMB Coach - 50 Question Sets Fixed
URL: https://kw88t9qlb5ky.space.minimax.io/dashboard

Extracted content:
```json
{
  "title": "JAMB Coach - 50 Question Sets Fixed",
  "url": "https://kw88t9qlb5ky.space.minimax.io/dashboard",
  "summary": "This page is the dashboard for a JAMB Coach platform, tailored for a 'Student' user. It provides an overview of the student's progress, including key performance metrics like questions practiced, average score, and study streak. It also details performance across various subjects (Mathematics, Physics, Chemistry, Biology, English Language), indicating attempted questions and accessible sets. The dashboard includes sections for 'Today's Questions' and 'Quick Actions' to facilitate practice and progress tracking. Navigation links to other parts of the platform (Practice, Pricing, Profile) are prominently displayed.",
  "key_points": [
    "User type identified as 'Student'.",
    "Main navigation includes Dashboard, Practice, Pricing, Profile, and Sign Out options.",
    "Available subjects for study are Mathematics, Physics, Chemistry, Biology, and English Language.",
    "Performance overview displays 'Questions Practiced: 0', 'Average Score: 0%', 'Predicted JAMB Score: N/A', and 'Study Streak: 0 days'.",
    "Detailed subject performance is provided for each subject, showing '0 questions attempted' and '0/0 question sets accessible' with '0%' performance, along with a direct 'Practice' link for each.",
    "A section for 'Today's Questions' is present, indicating the date 8/21/2025 and listing the subjects, with questions currently loading.",
    "Quick actions available are 'Free Practice' (to practice any subject) and 'View Progress' (to check detailed analytics)."
  ],
  "relevant_links": [
    "/dashboard",
    "/practice",
    "/pricing",
    "/profile",
    "/subject/Mathematics",
    "/subject/Physics",
    "/subject/Chemistry",
    "/subject/Biology",
    "/subject/English%20Language"
  ],
  "file_name": "jamb_coach_dashboard.json"
}
```
